Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSelectParametricProfileItemByPrefix(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSelectParametricProfileItemByTypeAndSubType(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSelectParametricProfileItemByProfileName(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSelectProfileItemByTypeAndSubType(System.Int32,System.Int32,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
rProfileItem: The profile item instance.
ProfileItemType: The profile item type.
ProfileItemSubType: The profile item sub type.
CrossSectionNumber: The cross section number.
Returns: True if success, otherwise false.

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSelectProfileItemSubTypes(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pProfileItemSubTypeEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.AddCrossSection(System.String,System.Int32,System.Double,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Location: The location value.
Type: The type number.
SubType: The subtype number.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ModifyCrossSection(System.String,System.Int32,System.Double,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Location: The location value.
Type: The type number.
SubType: The subtype number.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.DeleteCrossSection(System.String,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.SetEquivalentType(System.String,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
EquivalentType: The equivalent type.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.GetProfileItemCrossSection(System.String,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t@)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
isParametric: Specify is the profile is parametric or not.
CrossSection: The cross section.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ModifyProfileItemProperties(Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s@)
DO NOT USE! For internal usage only!
ProfileItemProperties: The profile item properties.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.GetProfileItemPropertiesByTypeAndSubType(System.Int32,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t@)
DO NOT USE! For internal usage only!
Type: The profile type.
SubType: The profile sub type.
CrossSection: The cross section.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportProfileItemsToFile(Tekla.Structures.CatalogInternal.dotcatProfileNames_t@,System.String,System.String)
DO NOT USE! For internal usage only!
profileNames: The profile item names.
path: The file path.
fileName: The file name.
Returns: 1 on success.

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportAddProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileName_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportGetParametricProfileTypeByPrefix(System.String,System.Int32@)
DO NOT USE! For internal usage only!
pProfilePrefix:
rProfileType:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportGetProfileType(System.String,System.Int32@)
DO NOT USE! For internal usage only!
pProfileName:
rProfileType:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportDeleteUserParametricProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportProfileItemProperties(Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s@)
DO NOT USE! For internal usage only!
pProfileItemProperties: The profile item properties.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportFinishList
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportRenameProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileName_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSaveProfileDatabaseNew
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportCreateSavePoint
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportRollbackToSavePoint
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportFinalizeImportProfilesFromFolderWithoutSave(System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
pConflicts:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportImportCustomComponentsFromPathWithUpdateCheck(System.String,System.Boolean)
DO NOT USE! For internal usage only!
Path:
ForcedUpdate:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportGetTranslatedOptionLabels(Tekla.Structures.CatalogInternal.dotcatUserPropertyOption2_t@)
DO NOT USE! For internal usage only!
userPropertyOption2:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportConvertFabricatorProfilesAndMaterialsToTS(Tekla.Structures.CatalogInternal.dotcatFabricatorDataFilePaths_t@)
DO NOT USE! For internal usage only!
FabricatorDataFilePaths:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.GetShapeByGuid(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSelectParametricProfileItemByPrefix(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSelectParametricProfileItemByTypeAndSubType(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSelectParametricProfileItemByProfileName(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSelectProfileItemByTypeAndSubType(System.Int32,System.Int32,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
ProfileItemType: The profile item type.
ProfileItemSubType: The profile item sub type.
CrossSectionNumber: The cross section number.
///
rProfileItem: The profile item instance.
Returns: True if success, otherwise false.

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSelectProfileItemSubTypes(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pProfileItemSubTypeEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatAddCrossSection(System.String,System.Int32,System.Double,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Location: The location value.
Type: The type number.
SubType: The subtype number.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatModifyCrossSection(System.String,System.Int32,System.Double,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Location: The location value.
Type: The type number.
SubType: The subtype number.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatDeleteCrossSection(System.String,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatSetEquivalentType(System.String,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
CrossSectionNumber: The cross section number.
EquivalentType: The equivalent type.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatGetProfileItemCrossSection(System.String,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t@)
DO NOT USE! For internal usage only!
ProfileName: The profile name.
isParametric: Specify is the profile is parametric or not.
CrossSection: The cross section.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatModifyProfileItemProperties(Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s@)
DO NOT USE! For internal usage only!
ProfileItemProperties: The profile item properties.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatGetProfileItemPropertiesByTypeAndSubType(System.Int32,System.Int32,Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t@)
DO NOT USE! For internal usage only!
Type: The profile type.
SubType: The profile sub type.
CrossSection: The cross section.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportProfileItemsToFile(Tekla.Structures.CatalogInternal.dotcatProfileNames_t@,System.String,System.String)
DO NOT USE! For internal usage only!
profileNames: The profile item names.
path: The file path.
fileName: The file name.
Returns: 1 on success

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportAddProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileName_t@,Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportGetParametricProfileTypeByPrefix(System.String,System.Int32@)
DO NOT USE! For internal usage only!
pProfilePrefix:
rProfileType:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportGetProfileType(System.String,System.Int32@)
DO NOT USE! For internal usage only!
pProfileName:
rProfileType:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportDeleteUserParametricProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportProfileItemProperties(Tekla.Structures.CatalogInternal.dotcatProfileItemPropertiesEnumerator_s@)
DO NOT USE! For internal usage only!
pProfileItemProperties: The profile item properties.
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportRenameProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileName_t@,Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pNewName:
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSaveProfileDatabaseNew
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportCreateSavePoint
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportRollbackToSavePoint
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportFinalizeImportProfilesFromFolderWithoutSave(Tekla.Structures.CatalogInternal.dotcatImportItem_t@)
DO NOT USE! For internal usage only!
item:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportImportCustomComponentsFromPathWithUpdateCheck(System.String,System.Boolean)
DO NOT USE! For internal usage only!
Path:
ForcedUpdate:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportGetTranslatedOptionLabels(Tekla.Structures.CatalogInternal.dotcatUserPropertyOption2_t@)
DO NOT USE! For internal usage only!
userPropertyOption2:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotExportConvertFabricatorProfilesAndMaterialsToTS(Tekla.Structures.CatalogInternal.dotcatFabricatorDataFilePaths_t)
DO NOT USE! For internal usage only!
FabricatorDataFilePaths:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatGetShapeByGuid(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.tsReadFinishes(System.Char**@,System.Char**@,System.Int32@)
